[
  {
    "name": "BITCOIN",
    "codeName": "BTC",
    "price": "29000",
    "description": "Bitcoin is a decentralized digital currency, without a central bank or single administrator. It was invented by an unknown person or group of people using the name Satoshi Nakamoto and released as open-source software in 2009. Bitcoins are created as a reward for a process known as mining. They can be exchanged for other currencies, products, and services. Bitcoin has been criticized for its use in illegal transactions, its high electricity consumption, price volatility, and thefts from exchanges.",
    "image": {
      "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Bitcoin.svg/800px-Bitcoin.svg.png",
      "alt": "Bitcoin Logo"
    }
  },
  {
    "name": "BINANCE",
    "codeName": "BNB",
    "price": "248",
    "description": "Binance Coin is a cryptocurrency used to pay for fees on the Binance cryptocurrency exchange. BNB was initially created as an ERC-20 token on the Ethereum blockchain but later migrated to Binance's own blockchain, Binance Chain. It has various use cases within the Binance ecosystem, including trading fee discounts, participating in token sales, and more.",
    "image": {
      "url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTS4EmOUlbDTRu0yrNO55Bj796fuKDhtUyDvQlGdBYA&s",
      "alt": "Binance Logo"
    }
  },
  {
    "name": "ETHEREUM",
    "codeName": "ETH",
    "price": "2000",
    "description": "Ethereum is a decentralized, open-source blockchain featuring smart contract functionality. Ether (ETH), the native cryptocurrency of the Ethereum platform, is used for various purposes, including executing smart contracts, securing the network through mining, and as a means of compensation for participants who perform computations and validate transactions. Ethereum has been a major player in the development of decentralized applications (DApps) and the broader blockchain space.",
    "image": {
      "url": "https://download.logo.wine/logo/Ethereum/Ethereum-Logo.wine.png",
      "alt": "Ethereum Logo"
    }
  }
]
