[
  {
    "name": "BITCOIN",
    "codeName": "BTC",
    "price": 29000,
    "description": "Bitcoin is a decentralized digital currency, without a central bank or single administrator. It was invented by an unknown person or group of people using the name Satoshi Nakamoto and released as open-source software in 2009. Bitcoins are created as a reward for a process known as mining. They can be exchanged for other currencies, products, and services. Bitcoin has been criticized for its use in illegal transactions, its high electricity consumption, price volatility, and thefts from exchanges.",
    "image": {
      "url": "https://cryptologos.cc/logos/bitcoin-btc-logo.png?v=029",
      "alt": "Bitcoin Logo"
    }
  },
  {
    "name": "BINANCE",
    "codeName": "BNB",
    "price": 248,
    "description": "Binance Coin is a cryptocurrency used to pay for fees on the Binance cryptocurrency exchange. BNB was initially created as an ERC-20 token on the Ethereum blockchain but later migrated to Binance's own blockchain, Binance Chain. It has various use cases within the Binance ecosystem, including trading fee discounts, participating in token sales, and more.",
    "image": {
      "url": "https://cryptologos.cc/logos/binance-coin-bnb-logo.png",
      "alt": "Binance Logo"
    }
  },
  {
    "name": "ETHEREUM",
    "codeName": "ETH",
    "price": 2000,
    "description": "Ethereum is a decentralized, open-source blockchain featuring smart contract functionality. Ether (ETH), the native cryptocurrency of the Ethereum platform, is used for various purposes, including executing smart contracts, securing the network through mining, and as a means of compensation for participants who perform computations and validate transactions. Ethereum has been a major player in the development of decentralized applications (DApps) and the broader blockchain space.",
    "image": {
      "url": "https://cryptologos.cc/logos/ethereum-eth-logo.png?v=029",
      "alt": "Ethereum Logo"
    }
  },
  {
    "name": "RIPPLE",
    "codeName": "XRP",
    "price": 1.25,
    "description": "Ripple (XRP) is a digital payment protocol that operates as both a cryptocurrency and technology protocol for payment remittance. Ripple's digital currency, XRP, acts as a bridge currency to facilitate fast and cost-effective cross-border transactions. The Ripple protocol aims to enable secure, instant, and low-cost global money transfers.",
    "image": {
      "url": "https://cryptologos.cc/logos/xrp-xrp-logo.png?v=029",
      "alt": "Ripple Logo"
    }
  },
  {
    "name": "CARDANO",
    "codeName": "ADA",
    "price": 1.75,
    "description": "Cardano (ADA) is a blockchain platform that aims to provide a more secure and sustainable infrastructure for the development of decentralized applications (DApps) and smart contracts. Cardano's design is focused on scalability, sustainability, and interoperability. ADA is the native cryptocurrency used on the Cardano platform.",
    "image": {
      "url": "https://cryptologos.cc/logos/cardano-ada-logo.png?v=029",
      "alt": "Cardano Logo"
    }
  },
  {
    "name": "POLKADOT",
    "codeName": "DOT",
    "price": 30,
    "description": "Polkadot (DOT) is a multi-chain blockchain platform that enables different blockchains to transfer messages and value in a trust-free fashion. It aims to facilitate the transfer of any data or asset type, not just tokens, thereby allowing for a wide range of applications, including decentralized finance (DeFi) and cross-chain communication.",
    "image": {
      "url": "https://cryptologos.cc/logos/polkadot-new-dot-logo.png?v=029",
      "alt": "Polkadot Logo"
    }
  },
  {
    "name": "LITECOIN",
    "codeName": "LTC",
    "price": 150,
    "description": "Litecoin (LTC) is a peer-to-peer cryptocurrency created by Charlie Lee in 2011. It is often referred to as the 'silver to Bitcoin's gold' and is designed to provide fast and low-cost transactions. Litecoin uses a different hashing algorithm (Scrypt) than Bitcoin (SHA-256) and has a maximum supply of 84 million coins.",
    "image": {
      "url": "https://cryptologos.cc/logos/litecoin-ltc-logo.png?v=029",
      "alt": "Litecoin Logo"
    }
  },
  {
    "name": "UNISWAP",
    "codeName": "UNI",
    "price": 25,
    "description": "Uniswap (UNI) is a decentralized exchange (DEX) built on the Ethereum blockchain. It enables users to swap various ERC-20 tokens directly from their wallets without the need for a traditional order book. UNI is the native governance token of the Uniswap protocol, allowing holders to participate in the decision-making process.",
    "image": {
      "url": "https://cryptologos.cc/logos/uniswap-uni-logo.png",
      "alt": "Uniswap Logo"
    }
  },
  {
    "name": "CHAINLINK",
    "codeName": "LINK",
    "price": 35,
    "description": "Chainlink (LINK) is a decentralized oracle network that enables smart contracts on the Ethereum blockchain to securely connect with real-world data, APIs, and payment systems. LINK is the native cryptocurrency used to pay for services on the Chainlink network and as collateral for node operators.",
    "image": {
      "url": "https://cryptologos.cc/logos/chainlink-link-logo.png?v=029",
      "alt": "Chainlink Logo"
    }
  },
  {
    "name": "DOGECOIN",
    "codeName": "DOGE",
    "price": 0.3,
    "description": "Dogecoin (DOGE) started as a meme cryptocurrency based on the popular 'Doge' internet meme featuring a Shiba Inu dog. Despite its origins, Dogecoin has gained popularity and is used for tipping and charitable donations. It features a fast block time and a large supply, making it accessible to a broad audience.",
    "image": {
      "url": "https://cryptologos.cc/logos/dogecoin-doge-logo.png?v=029",
      "alt": "Dogecoin Logo"
    }
  },
  {
    "name": "SOLANA",
    "codeName": "SOL",
    "price": 150,
    "description": "Solana (SOL) is a high-performance blockchain platform known for its fast transaction speeds and low fees. It uses a unique consensus mechanism called Proof of History (PoH) combined with Proof of Stake (PoS). Solana aims to provide a scalable and efficient infrastructure for decentralized applications (DApps) and crypto projects.",
    "image": {
      "url": "https://cryptologos.cc/logos/solana-sol-logo.png",
      "alt": "Solana Logo"
    }
  },
  {
    "name": "TRON",
    "codeName": "TRX",
    "price": 0.1,
    "description": "Tron (TRX) is a blockchain platform that aims to build a decentralized internet. It focuses on content sharing and entertainment applications, allowing content creators to bypass traditional intermediaries and connect directly with their audiences. TRX is the native cryptocurrency used within the Tron ecosystem.",
    "image": {
      "url": "https://cryptologos.cc/logos/tron-trx-logo.png?v=029",
      "alt": "Tron Logo"
    }
  },
  {
    "name": "VECHAIN",
    "codeName": "VET",
    "price": 0.15,
    "description": "VeChain (VET) is a blockchain platform designed for supply chain management and business processes. It uses blockchain technology to enhance transparency and traceability in supply chains, allowing users to track the authenticity and origin of products. VET is the native cryptocurrency of the VeChainThor blockchain.",
    "image": {
      "url": "https://cryptologos.cc/logos/vechain-vet-logo.png?v=029",
      "alt": "VeChain Logo"
    }
  },

  {
    "name": "POLYGON",
    "codeName": "MATIC",
    "price": 1.5,
    "description": "Polygon (MATIC) is a layer 2 scaling solution for Ethereum, offering faster and cheaper transactions. It aims to improve Ethereum's scalability and usability, providing a framework for building and connecting multiple chains. MATIC is the native cryptocurrency used on the Polygon network.",
    "image": {
      "url": "https://cryptologos.cc/logos/polygon-matic-logo.png",
      "alt": "Polygon Logo"
    }
  },
  {
    "name": "AVA Labs",
    "codeName": "AVAX",
    "price": 50,
    "description": "Avalanche (AVAX) is a decentralized platform designed for launching custom blockchain networks and decentralized applications (DApps). It employs a unique consensus protocol to achieve high throughput and enables the creation of interoperable blockchain networks. AVAX is the native cryptocurrency of the Avalanche platform.",
    "image": {
      "url": "https://cryptologos.cc/logos/avalanche-avax-logo.png?v=029",
      "alt": "Avalanche Logo"
    }
  },
  {
    "name": "TEZOS",
    "codeName": "XTZ",
    "price": 5,
    "description": "Tezos (XTZ) is a decentralized, self-amending blockchain platform that enables the creation of smart contracts and decentralized applications (DApps). It aims to provide a secure and upgradeable network through on-chain governance. XTZ is the native cryptocurrency used on the Tezos platform.",
    "image": {
      "url": "https://cryptologos.cc/logos/tezos-xtz-logo.png?v=029",
      "alt": "Tezos Logo"
    }
  },
  {
    "name": "BITCOIN CASH",
    "codeName": "BCH",
    "price": 530.78,
    "description": "Bitcoin Cash (BCH) is a peer-to-peer electronic cash system that emerged as a fork of Bitcoin (BTC). It aims to fulfill the vision of Bitcoin as a medium of exchange with lower transaction fees and faster confirmation times. Bitcoin Cash increases the block size limit, allowing for more transactions to be processed in each block.",
    "image": {
      "url": "https://cryptologos.cc/logos/bitcoin-cash-bch-logo.png",
      "alt": "Bitcoin Cash Logo"
    }
  },
  {
    "name": "ATOM",
    "codeName": "ATOM",
    "price": 26.92,
    "description": "Cosmos (ATOM) is a decentralized network of independent, scalable, and interoperable blockchains. It aims to solve the challenges of blockchain scalability, usability, and interoperability. ATOM is the native cryptocurrency of the Cosmos Hub, facilitating staking and governance within the network.",
    "image": {
      "url": "https://cryptologos.cc/logos/cosmos-atom-logo.png",
      "alt": "Cosmos Logo"
    }
  },
  {
    "name": "EOS",
    "codeName": "EOS",
    "price": 5.12,
    "description": "EOS.IO is a blockchain platform designed to support decentralized applications (DApps) at scale. It aims to provide a user-friendly experience for developers and end-users. EOS is the native cryptocurrency of the EOS.IO platform, used for transactions and network resource allocation.",
    "image": {
      "url": "https://cryptologos.cc/logos/eos-eos-logo.png",
      "alt": "EOS Logo"
    }
  },
  {
    "name": "Stellar",
    "codeName": "XLM",
    "price": 0.278356,
    "description": "Stellar (XLM) is a blockchain-based platform designed to facilitate fast, low-cost cross-border payments and create and trade digital representations of all forms of money.",
    "image": {
      "url": "https://cryptologos.cc/logos/stellar-xlm-logo.png?v=029",
      "alt": "Stellar Logo"
    }
  },
  {
    "name": "Shiba Inu",
    "codeName": "SHIB",
    "price": 0.000008,
    "description": "Shiba Inu (SHIB) is a meme cryptocurrency that gained popularity for its Shiba Inu dog logo. It operates as an experiment in decentralized community building and features an ecosystem with ShibaSwap and Bone tokens.",
    "image": {
      "url": "https://cryptologos.cc/logos/shiba-inu-shib-logo.png",
      "alt": "Shiba Inu Logo"
    }
  },
  {
    "name": "Filecoin",
    "codeName": "FIL",
    "price": 41.12,
    "description": "Filecoin (FIL) is a decentralized storage network that enables users to rent out their unused storage space. It aims to create a more efficient and reliable storage infrastructure for the decentralized web.",
    "image": {
      "url": "https://cryptologos.cc/logos/filecoin-fil-logo.png",
      "alt": "Filecoin Logo"
    }
  },
  {
    "name": "Monero",
    "codeName": "XMR",
    "price": 202.84,
    "description": "Monero (XMR) is a privacy-focused cryptocurrency that provides anonymous and untraceable transactions. It uses advanced cryptographic techniques to ensure the privacy and fungibility of coins.",
    "image": {
      "url": "https://cryptologos.cc/logos/monero-xmr-logo.png",
      "alt": "Monero Logo"
    }
  },
  {
    "name": "Kaspa",
    "codeName": "KASP",
    "price": 0.0501,
    "description": "Kaspa (KASP) is a blockchain platform designed to address scalability issues. It aims to provide a more scalable and efficient infrastructure for decentralized applications and services.",
    "image": {
      "url": "https://cryptologos.cc/logos/kaspa-kas-logo.png?v=029",
      "alt": "Kaspa Logo"
    }
  },
  {
    "name": "Maker",
    "codeName": "MKR",
    "price": 2604.79,
    "description": "Maker (MKR) is a governance token of the MakerDAO platform, which operates on the Ethereum blockchain. MakerDAO facilitates the creation of the stablecoin DAI and allows MKR holders to participate in the platform's governance.",
    "image": {
      "url": "https://cryptologos.cc/logos/maker-mkr-logo.png",
      "alt": "Maker Logo"
    }
  },
  {
    "name": "Fantom",
    "codeName": "FTM",
    "price": 1.35,
    "description": "Fantom (FTM) is a high-performance blockchain platform that aims to provide fast and scalable decentralized applications. It focuses on solving scalability issues and supporting a wide range of industries.",
    "image": {
      "url": "https://cryptologos.cc/logos/fantom-ftm-logo.png",
      "alt": "Fantom Logo"
    }
  },
  {
    "name": "Flow",
    "codeName": "FLOW",
    "price": 13.45,
    "description": "Flow (FLOW) is a blockchain platform designed for high-throughput and developer-friendly decentralized applications (DApps). It focuses on delivering a user-friendly experience for both developers and end-users.",
    "image": {
      "url": "https://cryptologos.cc/logos/flow-flow-logo.png",
      "alt": "Flow Logo"
    }
  },
  {
    "name": "The Sandbox",
    "codeName": "SAND",
    "price": 0.791,
    "description": "The Sandbox (SAND) is a virtual world and gaming platform that allows users to create, own, and monetize their gaming experiences. It operates on blockchain technology, providing true ownership of in-game assets.",
    "image": {
      "url": "https://cryptologos.cc/logos/the-sandbox-sand-logo.png",
      "alt": "The Sandbox Logo"
    }
  },
  {
    "name": "Axie Infinity",
    "codeName": "AXS",
    "price": 82.16,
    "description": "Axie Infinity (AXS) is a blockchain-based game where players collect, breed, and battle fantasy creatures called Axies. It features play-to-earn mechanics, allowing users to earn cryptocurrency by participating in the game.",
    "image": {
      "url": "https://cryptologos.cc/logos/axie-infinity-axs-logo.png",
      "alt": "Axie Infinity Logo"
    }
  },
  {
    "name": "BitTorrent",
    "codeName": "BTT",
    "price": 0.0025,
    "description": "BitTorrent (BTT) is a decentralized file-sharing protocol that enables users to share and download files using peer-to-peer technology. The BTT token is used within the BitTorrent ecosystem for various purposes.",
    "image": {
      "url": "https://cryptologos.cc/logos/bittorrent-btt-logo.png",
      "alt": "BitTorrent Logo"
    }
  },
  {
    "name": "Helium",
    "codeName": "HNT",
    "price": 14.72,
    "description": "Helium (HNT) is a blockchain network designed for the Internet of Things (IoT). It allows devices to connect and transfer data in a decentralized and secure manner. HNT is the native cryptocurrency of the Helium network.",
    "image": {
      "url": "https://cryptologos.cc/logos/helium-hnt-logo.png",
      "alt": "Helium Logo"
    }
  },
  {
    "name": "Binance USD",
    "codeName": "BUSD",
    "price": 1.0,
    "description": "Binance USD (BUSD) is a stablecoin pegged to the value of the US Dollar. It is issued on the Binance Smart Chain (BSC) and provides a stable value for users within the Binance ecosystem.",
    "image": {
      "url": "https://cryptologos.cc/logos/binance-usd-busd-logo.png",
      "alt": "Binance USD Logo"
    }
  },
  {
    "name": "KuCoin Shares",
    "codeName": "KCS",
    "price": 8.27,
    "description": "KuCoin Shares (KCS) is the native utility token of the KuCoin exchange. Holders of KCS receive various benefits, including trading fee discounts, token rewards, and participation in the KuCoin community.",
    "image": {
      "url": "https://cryptologos.cc/logos/kucoin-shares-kcs-logo.png",
      "alt": "KuCoin Shares Logo"
    }
  },
  {
    "name": "Neo",
    "codeName": "NEO",
    "price": 25.93,
    "description": "Neo (NEO) is a blockchain platform that supports the development of digital assets and smart contracts. It aims to create a smart economy by providing a scalable and developer-friendly blockchain infrastructure.",
    "image": {
      "url": "https://cryptologos.cc/logos/neo-neo-logo.png",
      "alt": "Neo Logo"
    }
  },
  {
    "name": "Decentraland",
    "codeName": "MANA",
    "price": 0.855,
    "description": "Decentraland (MANA) is a virtual reality platform built on the Ethereum blockchain. Users can buy, sell, and build on virtual land parcels, creating a decentralized and user-driven virtual world.",
    "image": {
      "url": "https://cryptologos.cc/logos/decentraland-mana-logo.png",
      "alt": "Decentraland Logo"
    }
  },
  {
    "name": "Gala",
    "codeName": "GALA",
    "price": 0.0857,
    "description": "Gala (GALA) is the native cryptocurrency of the Gala Games ecosystem, a blockchain-based gaming platform. It enables users to participate in gaming and earn rewards through play-to-earn mechanics.",
    "image": {
      "url": "https://cryptologos.cc/logos/gala-gala-logo.png",
      "alt": "Gala Logo"
    }
  }
]
